server/templates/v_10/suministroOperacionesIntracomunitarias/suministroLRDetOperacionIntracomunitaria.hbs

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sum="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/ssii/fact/ws/SuministroLR.xsd"
 xmlns:sum1="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/ssii/fact/ws/SuministroInformacion.xsd">
	<soapenv:Header/>
	<soapenv:Body>
		<sum:SuministroLRDetOperacionIntracomunitaria>
			<sum1:Cabecera>
				<sum1:IDVersionSii>{{ cabecera.idVersion }}</sum1:IDVersionSii>
				<sum1:Titular>
					<sum1:NombreRazon>{{ cabecera.titular.nombreRazon }}</sum1:NombreRazon>
					{{#if cabecera.titular.nifRepresentante}}
					<!--Optional:-->
					<sum1:NIFRepresentante>{{ cabecera.titular.nifRepresentante }}</sum1:NIFRepresentante>
					{{/if}}
					<sum1:NIF>{{ cabecera.titular.nif }}</sum1:NIF>
				</sum1:Titular>
				<sum1:TipoComunicacion>{{ cabecera.tipoCom }}</sum1:TipoComunicacion>
			</sum1:Cabecera>
			<!--1 to 10000 repetitions:-->
			{{#each registroLRDetOperacionIntracomunitaria}}
			<sum:RegistroLRDetOperacionIntracomunitaria>
				<sum1:PeriodoImpositivo>
					<sum1:Ejercicio>{{ this.periodoImpositivo.ejercicio }}</sum1:Ejercicio>
					<sum1:Periodo>{{ this.periodoImpositivo.periodo }}</sum1:Periodo>
				</sum1:PeriodoImpositivo>
				<sum:IDFactura>
					<sum1:IDEmisorFactura>
						<sum1:NombreRazon>{{ this.idFactura.idEmisorFactura.nombreRazon }}</sum1:NombreRazon>
						<!--You have a CHOICE of the next 2 items at this level-->
						{{#if this.idFactura.idEmisorFactura.nif}}
						<sum1:NIF>{{ this.idFactura.idEmisorFactura.nif }}</sum1:NIF>
						{{/if}}{{#ifNot this.idFactura.idEmisorFactura.nif}}
						<sum1:IDOtro>
							{{#if this.idFactura.idEmisorFactura.idOtro.codigoPais}}
							<!--Optional:-->
							<sum1:CodigoPais>{{ this.idFactura.idEmisor.idOtro.codigoPais }}</sum1:CodigoPais>
							{{/if}}
							<sum1:IDType>{{ this.idFactura.idEmisorFactura.idOtro.idType }}</sum1:IDType>
							<sum1:ID>{{ this.idFactura.idEmisorFactura.idOtro.id }}</sum1:ID>
						</sum1:IDOtro>
						{{/ifNot}}
					</sum1:IDEmisorFactura>
					<sum1:NumSerieFacturaEmisor>{{ this.idFactura.numSerieFacturaEmisor }}</sum1:NumSerieFacturaEmisor>
					<sum1:FechaExpedicionFacturaEmisor>{{ this.idFactura.fechaExpedicionFacturaEmisor }}</sum1:FechaExpedicionFacturaEmisor>
				</sum:IDFactura>
				<sum:Contraparte>
					<sum1:NombreRazon>{{ this.contraparte.nombreRazon }}</sum1:NombreRazon>
					{{#if this.contraparte.nifRepresentante}}
					<!--Optional:-->
					<sum1:NIFRepresentante>{{ this.contraparte.nifRepresentante }}</sum1:NIFRepresentante>
					{{/if}}
					<!--You have a CHOICE of the next 2 items at this level-->
					{{#if this.contraparte.nif}}
					<sum1:NIF>{{ this.contraparte.nif }}</sum1:NIF>
					{{/if}}{{#ifNot this.contraparte.nif}}
					<sum1:IDOtro>
						{{#if this.contraparte.idOtro.codigoPais}}
						<!--Optional:-->
						<sum1:CodigoPais>{{ this.contraparte.idOtro.codigoPais }}</sum1:CodigoPais>
						{{/if}}
						<sum1:IDType>{{ this.contraparte.idOtro.idType }}</sum1:IDType>
						<sum1:ID>{{ this.contraparte.idOtro.id }}</sum1:ID>
					</sum1:IDOtro>
					{{/ifNot}}
				</sum:Contraparte>
				<sum:OperacionIntracomunitaria>
					<sum1:TipoOperacion>{{ this.operacionIntracomunitaria.tipoOperacion }}</sum1:TipoOperacion>
					<sum1:ClaveDeclarado>{{ this.operacionIntracomunitaria.claveDeclarado }}</sum1:ClaveDeclarado>
					<sum1:EstadoMiembro>{{ this.operacionIntracomunitaria.estadoMiembro }}</sum1:EstadoMiembro>
					{{#if this.operacionIntracomunitaria.plazoOperacion}}
					<!--Optional:-->
					<sum1:PlazoOperacion>{{ this.operacionIntracomunitaria.plazoOperacion }}</sum1:PlazoOperacion>
					{{/if}}
					<sum1:DescripcionBienes>{{ this.operacionIntracomunitaria.descripcionBienes }}</sum1:DescripcionBienes>
					<sum1:DireccionOperador>{{ this.operacionIntracomunitaria.direccionOperador }}</sum1:DireccionOperador>
					{{#if this.operacionIntracomunitaria.facturasDocumentacion}}
					<!--Optional:-->
					<sum1:FacturasODocumentacion>{{ this.operacionIntracomunitaria.facturasDocumentacion }}</sum1:FacturasODocumentacion>
					{{/if}}
				</sum:OperacionIntracomunitaria>
			</sum:RegistroLRDetOperacionIntracomunitaria>
			{{/each}}
		</sum:SuministroLRDetOperacionIntracomunitaria>
	</soapenv:Body>
</soapenv:Envelope>